app/controllers/registrations_controller.rb

    def create

        resource = User.new(user_params)

        if resource.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "updated_at") VALUES (?, ?, ?, ?)